import java.util.*;
/**
|  S              |	 tax				|  T  |
|-----			 -|-------			 ---|-----|
|1000			  |0     			    |1000 |     |
|3500   		  |0 					|3500 |
|3500+1500=5000   |1500*3% = 45			|4955 |s = 
|5000+3000=8000   |45+3000*10%=345		|7655 |
|8000+4500=12500  |345+4500*20%=1245	|11255|
|12500+26000=38500|1245+26000*25%=7745  |30755|
|38500+20000=58500|7745+20000*30%=13745 |44755|
|58500+25000=83500|13745+25000*35%=22495|61005|
|90000            |22495+(90000-83500)*45%=25420|64580|
*/
public class Main{
	
	public static void main(String args[]){
		Scanner cin = new Scanner(System.in);
		int T = cin.nextInt();//税后工资
		double S = 0;//税前工资
		if(T <= 3500)
			S = T;
		else if(T <=4955){
			S = (T-105)/0.97;
		}else if(T <=7655){
			S = (T-455)/0.9;
		}else if(T <=11255){
			S = (T-1255)/0.8;
		}else if(T <=30755){
			S = (T-1880)/0.75;
		}else if(T <=44755){
			S = (T-3805)/0.7;
		}else if(T <=61005){
			S = (T-6730)/0.65;
		}else{
			S = (T-15080)/0.55;
		}
		/**
		之前没有下面这一行，会出现错误！原因是，当进行double的运算的时候，除法不是精确的；就算出来的值，在其精度内围绕理论值上下浮动；当计算值偏大时，取整后，结果正是我们想要的，没有问题；可是当结果偏小时，取整后，就会比理论值小1。因此加上加上下面这一行，避免浮点数除法造成的影响。结果就对了！
		*/
		int ss = ((int)S +1) / 100 * 100;
		System.out.println(ss);
	}
}
